{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(assignments(),scheduledActionsForRule(scheduledActionConfigurations()))/$entity",
    "@odata.type": "#microsoft.graph.macOSCompliancePolicy",
    "roleScopeTagIds": [
        "0"
    ],
    "id": "99643fc8-f54b-44cf-8a6f-6177a571cc5c",
    "createdDateTime": "2026-01-02T13:03:15.1949669Z",
    "description": null,
    "lastModifiedDateTime": "2026-01-02T13:03:15.1949669Z",
    "displayName": "MacOS Compliance Policy",
    "version": 1,
    "passwordRequired": true,
    "passwordBlockSimple": true,
    "passwordExpirationDays": null,
    "passwordMinimumLength": null,
    "passwordMinutesOfInactivityBeforeLock": null,
    "passwordPreviousPasswordBlockCount": null,
    "passwordMinimumCharacterSetCount": 1,
    "passwordRequiredType": "deviceDefault",
    "osMinimumVersion": "14",
    "osMaximumVersion": null,
    "osMinimumBuildVersion": null,
    "osMaximumBuildVersion": null,
    "systemIntegrityProtectionEnabled": true,
    "deviceThreatProtectionEnabled": false,
    "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
    "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
    "storageRequireEncryption": true,
    "gatekeeperAllowedAppSource": "macAppStoreAndIdentifiedDevelopers",
    "firewallEnabled": true,
    "firewallBlockAllIncoming": false,
    "firewallEnableStealthMode": false,
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('99643fc8-f54b-44cf-8a6f-6177a571cc5c')/microsoft.graph.macOSCompliancePolicy/assignments",
    "assignments": [
        {
            "id": "99643fc8-f54b-44cf-8a6f-6177a571cc5c_adadadad-808e-44e2-905a-0b7873a8a531",
            "source": "direct",
            "sourceId": "99643fc8-f54b-44cf-8a6f-6177a571cc5c",
            "target": {
                "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
                "deviceAndAppManagementAssignmentFilterId": null,
                "deviceAndAppManagementAssignmentFilterType": "none"
            }
        },
        {
            "id": "99643fc8-f54b-44cf-8a6f-6177a571cc5c_acacacac-9df4-4c7d-9d50-4ef0226f57a9",
            "source": "direct",
            "sourceId": "99643fc8-f54b-44cf-8a6f-6177a571cc5c",
            "target": {
                "@odata.type": "#microsoft.graph.allLicensedUsersAssignmentTarget",
                "deviceAndAppManagementAssignmentFilterId": null,
                "deviceAndAppManagementAssignmentFilterType": "none"
            }
        }
    ],
    "scheduledActionsForRule@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('99643fc8-f54b-44cf-8a6f-6177a571cc5c')/microsoft.graph.macOSCompliancePolicy/scheduledActionsForRule(scheduledActionConfigurations())",
    "scheduledActionsForRule": [
        {
            "id": "99643fc8-f54b-44cf-8a6f-6177a571cc5c",
            "ruleName": null,
            "scheduledActionConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies('99643fc8-f54b-44cf-8a6f-6177a571cc5c')/microsoft.graph.macOSCompliancePolicy/scheduledActionsForRule('99643fc8-f54b-44cf-8a6f-6177a571cc5c')/scheduledActionConfigurations",
            "scheduledActionConfigurations": [
                {
                    "id": "54cb122f-8966-43d3-bfed-8d72a2925d1b",
                    "gracePeriodHours": 0,
                    "actionType": "block",
                    "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
                    "notificationMessageCCList": []
                }
            ]
        }
    ]
}