//PATCH https://graph.microsoft.com/beta/deviceManagement/deviceEnrollmentConfigurations/d1d30cb8-3f6d-4261-a1b6-9d9de7dfde6c_DefaultPlatformRestrictions
{
    "@odata.type": "#microsoft.graph.deviceEnrollmentPlatformRestrictionsConfiguration",
    "androidRestriction": {
        "platformBlocked": true,
        "personalDeviceEnrollmentBlocked": false,
        "osMinimumVersion": "",
        "osMaximumVersion": "",
        "blockedManufacturers": []
    },
    "androidForWorkRestriction": {
        "platformBlocked": true,
        "personalDeviceEnrollmentBlocked": false,
        "osMinimumVersion": "",
        "osMaximumVersion": "",
        "blockedManufacturers": []
    },
    "iosRestriction": {
        "platformBlocked": true,
        "personalDeviceEnrollmentBlocked": false,
        "osMinimumVersion": "",
        "osMaximumVersion": "",
        "blockedManufacturers": []
    },
    "macOSRestriction": {
        "platformBlocked": false,
        "personalDeviceEnrollmentBlocked": true,
        "osMinimumVersion": null,
        "osMaximumVersion": null,
        "blockedManufacturers": []
    },
    "windowsRestriction": {
        "platformBlocked": false,
        "personalDeviceEnrollmentBlocked": true,
        "osMinimumVersion": "10.0",
        "osMaximumVersion": "12.0",
        "blockedManufacturers": []
    },
    "windowsHomeSkuRestriction": {
        "platformBlocked": false,
        "personalDeviceEnrollmentBlocked": true,
        "osMinimumVersion": null,
        "osMaximumVersion": null,
        "blockedManufacturers": []
    }
}