{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
    "createdDateTime": "2024-05-19T04:00:24.5164686Z",
    "creationSource": null,
    "description": "",
    "lastModifiedDateTime": "2025-02-12T02:51:40.9912765Z",
    "platforms": "macOS",
    "priorityMetaData": null,
    "roleScopeTagIds": [
        "0"
    ],
    "settingCount": 2,
    "technologies": "mdm,appleRemoteManagement",
    "id": "05cf84a3-e7b6-477e-9f2f-838b595546a8",
    "templateReference": {
        "templateId": "",
        "templateFamily": "none",
        "templateDisplayName": null,
        "templateDisplayVersion": null
    },
    "settings": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "com.apple.extensiblesso_com.apple.extensiblesso",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "groupSettingCollectionValue": [
                    {
                        "settingValueTemplateReference": null,
                        "children": [
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.extensiblesso_authenticationmethod",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.extensiblesso_authenticationmethod_0",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "com.apple.extensiblesso_extensionidentifier",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                    "settingValueTemplateReference": null,
                                    "value": "com.microsoft.CompanyPortalMac.ssoextension"
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                "settingDefinitionId": "com.apple.extensiblesso_platformsso",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "groupSettingCollectionValue": [
                                    {
                                        "settingValueTemplateReference": null,
                                        "children": [
                                            {
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                "settingDefinitionId": "com.apple.extensiblesso_platformsso_accountdisplayname",
                                                "settingInstanceTemplateReference": null,
                                                "auditRuleInformation": null,
                                                "simpleSettingValue": {
                                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                    "settingValueTemplateReference": null,
                                                    "value": "MONXA EntraID Account"
                                                }
                                            },
                                            {
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                "settingDefinitionId": "com.apple.extensiblesso_platformsso_authenticationmethod",
                                                "settingInstanceTemplateReference": null,
                                                "auditRuleInformation": null,
                                                "choiceSettingValue": {
                                                    "settingValueTemplateReference": null,
                                                    "value": "com.apple.extensiblesso_platformsso_authenticationmethod_0",
                                                    "children": []
                                                }
                                            },
                                            {
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                "settingDefinitionId": "com.apple.extensiblesso_platformsso_enablecreateuseratlogin",
                                                "settingInstanceTemplateReference": null,
                                                "auditRuleInformation": null,
                                                "choiceSettingValue": {
                                                    "settingValueTemplateReference": null,
                                                    "value": "com.apple.extensiblesso_platformsso_enablecreateuseratlogin_true",
                                                    "children": []
                                                }
                                            },
                                            {
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                "settingDefinitionId": "com.apple.extensiblesso_platformsso_newuserauthorizationmode",
                                                "settingInstanceTemplateReference": null,
                                                "auditRuleInformation": null,
                                                "choiceSettingValue": {
                                                    "settingValueTemplateReference": null,
                                                    "value": "com.apple.extensiblesso_platformsso_newuserauthorizationmode_0",
                                                    "children": []
                                                }
                                            },
                                            {
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                "settingDefinitionId": "com.apple.extensiblesso_platformsso_useshareddevicekeys",
                                                "settingInstanceTemplateReference": null,
                                                "auditRuleInformation": null,
                                                "choiceSettingValue": {
                                                    "settingValueTemplateReference": null,
                                                    "value": "com.apple.extensiblesso_platformsso_useshareddevicekeys_false",
                                                    "children": []
                                                }
                                            },
                                            {
                                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                "settingDefinitionId": "com.apple.extensiblesso_platformsso_userauthorizationmode",
                                                "settingInstanceTemplateReference": null,
                                                "auditRuleInformation": null,
                                                "choiceSettingValue": {
                                                    "settingValueTemplateReference": null,
                                                    "value": "com.apple.extensiblesso_platformsso_userauthorizationmode_0",
                                                    "children": []
                                                }
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "com.apple.extensiblesso_registrationtoken",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                    "settingValueTemplateReference": null,
                                    "value": "{{DEVICEREGISTRATION}}"
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.extensiblesso_screenlockedbehavior",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.extensiblesso_screenlockedbehavior_0",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "com.apple.extensiblesso_teamidentifier",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingValue": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                    "settingValueTemplateReference": null,
                                    "value": "UBF8T346G9"
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.extensiblesso_type",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.extensiblesso_type_1",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                                "settingDefinitionId": "com.apple.extensiblesso_urls",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "simpleSettingCollectionValue": [
                                    {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                        "settingValueTemplateReference": null,
                                        "value": "https://login.microsoftonline.com"
                                    },
                                    {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                        "settingValueTemplateReference": null,
                                        "value": "https://login.microsoft.com"
                                    },
                                    {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                        "settingValueTemplateReference": null,
                                        "value": "https://sts.windows.net"
                                    },
                                    {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                        "settingValueTemplateReference": null,
                                        "value": "https://login.partner.microsoftonline.cn"
                                    },
                                    {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                        "settingValueTemplateReference": null,
                                        "value": "https://login.chinacloudapi.cn"
                                    },
                                    {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                        "settingValueTemplateReference": null,
                                        "value": "https://login.microsoftonline.us"
                                    },
                                    {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                        "settingValueTemplateReference": null,
                                        "value": "https://login-us.microsoftonline.com"
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "1",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "com.apple.preference.security_com.apple.preference.security",
                "settingInstanceTemplateReference": null,
                "auditRuleInformation": null,
                "groupSettingCollectionValue": [
                    {
                        "settingValueTemplateReference": null,
                        "children": [
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.preference.security_dontallowpasswordresetui",
                                "settingInstanceTemplateReference": null,
                                "auditRuleInformation": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.preference.security_dontallowpasswordresetui_true",
                                    "children": []
                                }
                            }
                        ]
                    }
                ]
            }
        }
    ]
}